<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые Ресурсы Сброса Пароля
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы являются строками по умолчанию, которые
    | соответствуют причинам, указанным брокером паролей для неудачной
    | попытки обновления пароля, например из-за недопустимого токена или
    | недопустимого нового пароля.
    |
    */

    'reset' => 'Ваш пароль был сброшен.',
    'sent' => 'Ссылка на сброс пароля была отправлена.',
    'throttled' => 'Пожалуйста, подождите перед повторной попыткой.',
    'token' => 'Ошибочный код сброса пароля.',
    'user' => 'Не удалось найти пользователя с указанным электронным адресом.',

];
